Table of Contents
 Enum HingeTypeInDirrection
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Type of hinge in the direction
public enum HingeTypeInDirrection
Fields
Flexible = 2
Initial stiffness is aplied
FullHinge = 1
Full hinge, zero stiffness is aplied
NoHinge = 0
No hinge defined
Nonlinear = 3
Nonlinear function is aplied
Fields
 Name |  Description
 Flexible = 2
Initial stiffness is aplied
 FullHinge = 1
Full hinge, zero stiffness is aplied
 NoHinge = 0
No hinge defined
 Nonlinear = 3
Nonlinear function is aplied
 Edit this page